/**********************************************
 * FileName:
 *
 * FileBrief: 
 *
 * Created on: 
 *
 * Author:   shanght(DylanShang)
 *
 * Remark:
 ******************************************/
#include "global.h"
/******************************Extern******************************/

/******************************Param*******************************/
/******************************Param*******************************/

/******************************Func********************************/
/***************************************************
* 函数：	dohitech_mcu_led_toggle
* 功能：	led 闪烁
* 参数：                           in/out          说明
* 
*返回值              说明
*
* 说明：
* 时间         版本          作者            说明
* -------------------------------------------------
* 2020/09/26   v1.0    shanght(DylanShang)		创建
**************************************************/
#define DELAYTIME	1000
void dohitech_mcu_led_toggle(void)
{
	GPIO_BC(GPIOB) = GPIO_PIN_3;
//	GPIO_BC(GPIOD) = GPIO_PIN_2;
	delay_1ms(DELAYTIME);
	GPIO_BOP(GPIOB) = GPIO_PIN_3;
//	GPIO_BOP(GPIOD) = GPIO_PIN_2;
	delay_1ms(DELAYTIME);
}

/******************************Func********************************/

